const animals = [//animal_type 동물타입 0고양이, 1사자, 2호랑이,3개, 4늑대, 5물개, 6너구리, 7쥐, 8토끼, 9원숭이, 10고릴라, 11캥거루, 12소, 13곰, 14말, 15사슴, 16코뿔소, 17코끼리, 18기린, 19새, 20독수리, 21뱀, 22도마뱀, 23거북이, 24개구리
    //equip 아이템 장착착용 0없음, 1투구, 2옷, 3장비, 4반지, 5목걸이, 10짐
    //할퀴기3, 물기7, 치기9, 누르기2, 찌르기4
    {idx:0,na:'고양이',equip:[1,2,3,3,4,5,0,0]},//6 할퀴기, 물기, 치기
    {idx:1,na:'사자',equip:[1,2,3,3,4,4,5,0]},//7 할퀴기, 물기, 치기
    {idx:2,na:'호랑이',equip:[1,2,3,3,4,5,5,0]},//7 할퀴기, 물기, 치기
    {idx:3,na:'개',equip:[1,2,3,4,5,10,0,0]},//6 물기, 치기
    {idx:4,na:'늑대',equip:[1,2,3,4,4,5,5,0]},//7 물기, 치기
    {idx:5,na:'물개',equip:[1,2,3,5,10,10,0,0]},//6 치기, 누르기
    {idx:6,na:'너구리',equip:[1,2,3,4,4,5,0,0]},//6 치기, 물기
    {idx:7,na:'쥐',equip:[1,2,3,5,0,0,0,0]},//4 물기
    {idx:8,na:'토끼',equip:[1,2,3,4,5,0,0,0]},//5 치기 물기
    {idx:9,na:'원숭이',equip:[1,2,3,3,4,4,5,0]},//6 치기, 물기
    {idx:10,na:'고릴라',equip:[1,2,2,3,3,4,4,5]},//8 치기, 누르기
    {idx:11,na:'캥거루',equip:[1,2,3,4,4,5,10,0]},//7 치기
    {idx:12,na:'소',equip:[1,2,2,3,5,10,10,10]},//8 누르기, 찌르기
    {idx:13,na:'곰',equip:[1,2,2,3,4,5,10,10]},//8 치기, 누르기, 할퀴기
    {idx:14,na:'말',equip:[1,2,2,3,5,10,10,10]},//8 치기, 누르기
    {idx:15,na:'사슴',equip:[1,2,3,5,5,10,0,0]},//6 찌르기, 치기
    {idx:16,na:'코뿔소',equip:[1,2,2,3,5,10,10,10]},//8 찌르기, 누르기
    {idx:17,na:'코끼리',equip:[1,2,2,3,10,10,10,10]},//8 누르기, 치기
    {idx:18,na:'기린',equip:[1,2,2,3,5,5,5,10]},//8 치기, 누르기
    {idx:19,na:'새',equip:[1,2,3,4,5,0,0,0]},//5 찌르기, 물기
    {idx:20,na:'독수리',equip:[1,2,3,3,4,4,5,0]},//7 찌르기, 할퀴기, 물기
    {idx:21,na:'뱀',equip:[1,2,3,5,5,0,0,0]},//5 물기
    {idx:22,na:'도마뱀',equip:[1,2,3,4,5,0,0,0]},//5 물기, 치기
    {idx:23,na:'거북이',equip:[1,2,2,3,5,10,0,0]},//5 물기
    {idx:24,na:'개구리',equip:[1,2,3,4,0,0,0,0]},//4 물기
    {idx:25,na:'돼지',equip:[1,2,2,3,4,5,10,10,0]}//4 물기, 누르기
]